Manipolazione e Aggregazione dei Dati

Obiettivo: Approfondire le capacità di manipolazione e aggregazione dei dati con
pandas.



Dataset: Utilizzare un dataset che registra le vendite di prodotti in diverse
città, includendo le colonne Prodotto, Quantità, Prezzo Unitario e Città.



Caricare i dati in un DataFrame.
Aggiungere una colonna "Totale Vendite" che sia il risultato del prodotto tra
Quantità e Prezzo Unitario.
Raggruppare i dati per Prodotto e calcolare il totale delle vendite per
ciascun prodotto.
Trovare il prodotto più venduto in termini di Quantità.
Identificare la città con il maggior volume di vendite totali.
Creare un nuovo DataFrame che mostri solo le vendite superiori a un certo
valore (es., 1000 euro).
Ordinare il DataFrame originale per la colonna "Totale Vendite" in ordine
decrescente.
Visualizzare il numero di vendite per ogni città.

In [268]:
import numpy as np
import pandas as pd
np.__version__, pd.__version__

('1.26.4', '2.2.2')

In [269]:
colonne = ["Prodotto", "Quantità", "Prezzo Unitario", "Città"]
lista_citta = ['Roma', 'Siena', 'Milano', 'Verona', 'Cosenza', 'Catanzaro', 'San Lucido']
lista_prodotti =['Cacicavallo', 'Mortadella', 'Mozzarella', 'Porcini', 'Patate' ]
LEN_DATA = 1000

# Creo il DataFrame

df = pd.DataFrame({
    "Prodotto":np.random.choice(lista_prodotti, LEN_DATA),
    "Città":np.random.choice(lista_citta, LEN_DATA),
    "Quantità":np.random.randint(1, 10, LEN_DATA),
    "Prezzo Unitario": np.random.randint(5, 30, LEN_DATA)
    })
df.head()

      Prodotto       Città  Quantità  Prezzo Unitario
0  Cacicavallo      Milano         2               29
1       Patate      Verona         3                8
2      Porcini      Milano         2               14
3      Porcini  San Lucido         5               15
4   Mortadella     Cosenza         4               24

In [270]:
df["Totale Vendite"] = df["Quantità"] * df["Prezzo Unitario"]
df.head()

      Prodotto       Città  Quantità  Prezzo Unitario  Totale Vendite
0  Cacicavallo      Milano         2               29              58
1       Patate      Verona         3                8              24
2      Porcini      Milano         2               14              28
3      Porcini  San Lucido         5               15              75
4   Mortadella     Cosenza         4               24              96

In [271]:
grup_prodotti = df['Totale Vendite'].groupby(df['Prodotto'])

# Totale delle vendite per ogni prodotto

totale_prodotti = grup_prodotti.sum()
totale_prodotti.sort_values(ascending=False, inplace=True)
totale_prodotti

Prodotto
Mortadella     18472
Patate         16957
Mozzarella     16933
Cacicavallo    16823
Porcini        15632
Name: Totale Vendite, dtype: int32

In [272]:
grup_prodotti2 = df['Quantità'].groupby(df['Prodotto'])
df_qty = grup_prodotti2.sum()
df_qty.sort_values(ascending=False, inplace=True)
df_qty.idxmax(), df_qty[df_qty.idxmin()]

('Mortadella', 953)

In [273]:
grup_prodotti3 = df['Quantità'].groupby(df['Città'])
df_city = grup_prodotti3.sum()
df_city.sort_values(ascending=False, inplace=True)
df_city.idxmax(), df_city[df_city.idxmin()]

('San Lucido', 593)

In [274]:
new_df = df[df['Quantità']>5]
new_df.head()

      Prodotto    Città  Quantità  Prezzo Unitario  Totale Vendite
5   Mozzarella   Milano         8               24             192
6       Patate  Cosenza         7               29             203
8      Porcini   Verona         6                6              36
9   Mortadella     Roma         9               23             207
10      Patate     Roma         7                7              49

In [275]:
group_city_2 = df['Totale Vendite'].groupby(df['Città'])
df_city_2 = group_city_2.sum()
df_city_2.sort_values( ascending=True, inplace=True)
df_city_2

Città
Siena         10163
Milano        10299
Verona        11654
Catanzaro     12478
Cosenza       12894
Roma          13594
San Lucido    13735
Name: Totale Vendite, dtype: int32

In [277]:
grup_prodotti4 = df['Totale Vendite'].groupby(df['Città'])
df_tot= grup_prodotti4.sum()
df_tot

Città
Catanzaro     12478
Cosenza       12894
Milano        10299
Roma          13594
San Lucido    13735
Siena         10163
Verona        11654
Name: Totale Vendite, dtype: int32